; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c2-s1-p16-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 
          t0 t1 
          l0-0 l1-0 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (TRUCK t0)
    (TRUCK t1)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (at t0 l0-0)
    (at t1 l1-0)
    (at p0 l0-0)
    (at p1 l1-0)
    (at p2 l0-0)
    (at p3 l1-0)
    (at p4 l1-0)
    (at p5 l0-0)
    (at p6 l1-0)
    (at p7 l0-0)
    (at p8 l1-0)
    (at p9 l1-0)
    (at p10 l1-0)
    (at p11 l0-0)
    (at p12 l0-0)
    (at p13 l1-0)
    (at p14 l1-0)
    (at p15 l0-0)
    (at a0 l1-0)
)
(:goal
    (and
        (at p0 l1-0)
        (at p1 l1-0)
        (at p2 l1-0)
        (at p3 l0-0)
        (at p4 l1-0)
        (at p5 l1-0)
        (at p6 l1-0)
        (at p7 l1-0)
        (at p8 l1-0)
        (at p9 l1-0)
        (at p10 l0-0)
        (at p11 l0-0)
        (at p12 l1-0)
        (at p13 l1-0)
        (at p14 l1-0)
        (at p15 l1-0)
    )
)
)

; plan
1. (load-airplane p3 a0 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a0)
   goals met: 8 of 16
2. (load-airplane p10 a0 l1-0)
   deleted: (at p10 l1-0)
   added: (in p10 a0)
   goals met: 8 of 16
3. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 8 of 16
4. (load-airplane p7 a0 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 a0)
   goals met: 8 of 16
5. (load-airplane p5 a0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 a0)
   goals met: 8 of 16
6. (unload-airplane p3 a0 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 9 of 16
7. (load-airplane p2 a0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a0)
   goals met: 9 of 16
8. (load-airplane p15 a0 l0-0)
   deleted: (at p15 l0-0)
   added: (in p15 a0)
   goals met: 9 of 16
9. (load-airplane p12 a0 l0-0)
   deleted: (at p12 l0-0)
   added: (in p12 a0)
   goals met: 9 of 16
10. (unload-airplane p10 a0 l0-0)
   deleted: (in p10 a0)
   added: (at p10 l0-0)
   goals met: 10 of 16
11. (load-airplane p0 a0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 10 of 16
12. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 10 of 16
13. (unload-airplane p7 a0 l1-0)
   deleted: (in p7 a0)
   added: (at p7 l1-0)
   goals met: 11 of 16
14. (unload-airplane p5 a0 l1-0)
   deleted: (in p5 a0)
   added: (at p5 l1-0)
   goals met: 12 of 16
15. (unload-airplane p2 a0 l1-0)
   deleted: (in p2 a0)
   added: (at p2 l1-0)
   goals met: 13 of 16
16. (unload-airplane p15 a0 l1-0)
   deleted: (in p15 a0)
   added: (at p15 l1-0)
   goals met: 14 of 16
17. (unload-airplane p12 a0 l1-0)
   deleted: (in p12 a0)
   added: (at p12 l1-0)
   goals met: 15 of 16
18. (unload-airplane p0 a0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 16 of 16
